Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: tm/5pice_ceshi-omegat.tmx
Source language: en_us
Languages: zh_cn

source: When instances are drawn on the screen they are drawn in order of depth, with instances that have the highest depth being drawn first and instances with the lowest depth being drawn last.
zh_cn: 深度越高越先绘制。

source: When just running games, the memory requirements are less severe and depend a lot on the type of game as well as the resources being used.
zh_cn: 内存需求很大程度上取决于游戏类型以及所使用的资源。

source: When making games, it is often necessary to store information about the game state in a file of some type, but storing this information on the device is not always the best option as, if the player deleted the game and then re-installs, this information may be lost.
zh_cn: 在游戏开发过程中，常常需要将游戏的状态信息保存在特定类型的文件中，但是把这些信息保存在本地设备上在大多数时候并不是一个好的选择，因为当玩家在卸载游戏之后重新安装时，这些数据可能会丢失。

source: When making your game, they can be added at any time using f9 (or using the right mouse button and selecting "toggle breakpoint"), either on an action in the object window, or on a line in a code editor window.
zh_cn: 当制作游戏的时候，你可以用F9来添加断点（或者使用鼠标右击然后选择“添加断点”），不管是在物体（object）窗口中的动作（action）上还是在编辑窗口中的代码行中。

source: When passing in arguments as an array of values you can use argument_count to find out how many there are and adapt the script to use only those arguments supplied.
zh_cn: 当使用参数数组的形式传递参数，你可以使用 argument_count得知使用了多少个参数，从而自动适应只使用传入的参数（即可选参数）。

source: When set to true (and you have vSync active) an alternative method will be used to that which is the default, with the aim to reduce any possible visual lag or stuttering of your game.
zh_cn: 当设置为 true （并且激活了垂直同步）时，替代方法将被使用，取代默认的方法，以减少任何可能的视觉延迟。

source: When starting a new one, you can provide the directory to save the project files to (which will be saved using the *.GMX format), as well as assign a name to your new project.
zh_cn: 当创建新工程的时候，你可以选择工程保存的目录 (将使用 *.GMX 格式保存)以及工程名。

source: When the day is up, if your game is either in the background or not running, a notification will be shown to the user with the given title and message (on iOS, the game name is shown and the title is ignored), and then an asynchronous Push Notification Event will be called.
zh_cn: 一天以后，无论你的程序是在后台还是未启动状态，玩家都将收到之前设置的通知（在iOS平台标题被游戏的名字替代了），然后一个异步的推送通知事件（Push Notification Event）会被触发。

source: When the file name ends with _stripXX, where XX a number, it is considered to contain a strip of XX subimages next to each other, and GameMaker: Studio will import it as such.
zh_cn: 当文件名以 _stripXX 结尾，会被认为包含 XX 个子图像，GameMaker: Studio 将会如此加载。

source: When the game is paused, you can then use the next three buttons for "stepping" through your code.
zh_cn: 当游戏暂停的时候，你可以之后使用下面三个按钮来“逐步”运行你的代码。

source: When the operating system delivers a local or remote push notification and the target application is not running in the foreground, it presents the notification to the user in the form of a banner.
zh_cn: 当操作系统推送了一个本地或远程的通知而目标程序并没有在前台运行时，通知将会以banner(横幅) 的形式来展示。

source: When the surface is first created, it may contain "noise" as basically it is just an area of memory that is put aside for the purpose (and that memory may still contain information), so you may want to clear the surface before use with a function like draw_clear_alpha.
zh_cn: 第一次创建的表面图层可能会包含一些“噪音”，基本上是因为它只是为了特别目的而放置一边的内存区域（并且那个内存可能仍然包含信息），所以你可能会需要在使用之前用draw_clear_alpha这样的函数清理这个表面图层。

source: When there are multiple subimages, you can cycle through them using the arrow buttons that appear beside the part of the window labelled "Show", and, should you make any changes to the sprite, you can then save it again using the "Save" button.
zh_cn: 当有多个子图像时，你可以通过方向按钮浏览他们。做任何更改之后请点击 "Save (保存)" 按钮。

source: When two instances come together, GameMaker: Studio has to decide whether a collision has occurred and to do this it relies on the mask of the object, either the one defined here or the one that is defined in the sprite properties.
zh_cn: 当两个实例重叠，GameMaker: Studio 就决定是否发生碰撞，这依赖于遮罩 (可以是精灵的遮罩或是物体本身的遮罩)。

source: When using scripts or pieces of code you have more control over the way the path is executed, and there are a variety of functions that cover basic actions like starting the path (see Reference - Paths), and more complex actions like modifying and changing path points from within the game (see Reference - Changing Paths).
zh_cn: 当你使用脚本或者一小段代码片段时，你对于路径是如何工作的可以有更多的选择，同时我们有不少现成的函数来完成一些基础的路径动作，比如沿路径运动（参见 代码参考 - 路径），以及更加复杂的函数，比如在游戏中修改一个路径上的路径点（参见 代码参考 - 改变路径）。

source: When using the argument0...15 variables for a script, you must ensure that the script uses all the supplied arguments.
zh_cn: 在脚本使用argument0...15变量，你必须确保这个脚本使用了所有指定的参数。

source: When working on mobile devices (in particular Android devices) this is an important factor to take into consideration as what may be appropriate for one display resolution, may not be appropriate for another.
zh_cn: 在移动设备上运行时（尤其是安卓设备），这是一个重要的考量，适合这个显示器的分辨率时，可能不适合另外一个。

source: When working with surfaces, it is often required that you draw the whole visible region of the screen to the surface, and so you would assign it to a view using this function.
zh_cn: 表面工作时，经常需要绘制 整个 屏幕的可见区域至表面层，所以你需要使用这个函数指定给一个视野。

source: When you are happy with the information, you can click on the button labelled Create and your file will be sent to the Steam server automatically.
zh_cn: 当确定信息无误后，单击 Create 你的文件就会自动发送到 Steam 服务器。

source: When you are watching a variable in any of the windows, it can be one of multiple data-types.
zh_cn: 当你观察任何窗口中的变量时，它都可能是数种数据类型中的任意一个。

source: When you are working with surfaces, you should always use this function whenever you are finished using them.
zh_cn: 当你用到表面图层时，不论是否结束使用，你应该一直使用这个函数。

source: When you check this box you are telling GameMaker: Studio that this object should be part of a physics world.
zh_cn: 当你选中这个复选框的时候，就是告诉 GameMaker: Studio 这个物体应该作为物理世界的一部分。

source: When you create a script, you want to access the arguments passed to it, either when using the script action, or when calling the script as a function from a program (or from another script).
zh_cn: 当你在他j建一个脚本，你或者想向它传递参数，或者使用脚本动作，或者在程序中调用脚本（或者其它脚本中）。

source: When you have "maintain aspect ratio" ticked in the Global Game Settings for a target platform, GameMaker: Studio will automatically set the draw position for the application surface so that it is displayed correctly centered and scaled on the given display.
zh_cn: 当你在全局游戏设定中为一个目标平台打开“保持纵横比”，GameMaker: Studio 将自动设置应用表面层的绘制位置，让显示器正确的居中放大显示。

source: When you have found the sprite you need and selected the transparency options you like, press Open to load the sprite into GameMaker: Studio.
zh_cn: 选好了这些选项按下 Open 按钮把 sprite 载入 GameMaker: Studio。

source: When you load an animated gif, the different images of the animation automatically form the sprite subimages.
zh_cn: 当你加载一个 gif 动画，动画不同的帧将自动分割成 sprites 不同的帧

source: When you open the editor you will be presented with the following window: Along the top of the window are the tabs for each of the editors available, as well as a "General" tab for the main IDE keyboard shortcuts.
zh_cn: 当你打开编辑器你将看到如下窗口: 在窗口顶部的选项卡对应着每个编辑器，再加上 "General (通用)" 选项卡配置整个集成开发环境。

source: When you put instances in a room in the room editor, this instance id is shown at the bottom of the screen when you hover the mouse cursor over the instance, but even if you create an instance through code it still has its unique id number.
zh_cn: 当你在一个房间（房间编辑器）里放置实例，鼠标悬放在实例上会在编辑器状态栏看到实例ID，甚至使用代创建的实例也会有一个独立的id数值。

source: When you run your game, this surface is created the first time that the draw event is called in each new room that you enter, which means that nothing is drawn until that point.
zh_cn: 当你运行游戏时，在进入每个新房间调用绘制事件的第一时间会创建这个表面， 这意味着在那之前什么都不会绘制。

source: When you select the Create Executable for Steam Workshop, a new window will open where you must specify certain details that Steam require for you to upload to their site: At the top of the window, you should add the name of your game (this is what people will see displayed on Steam), then upload a screenshot to show something of your game itself.
zh_cn: 当你选择 Create Executable 按钮创建 Steam 创意工坊文件，将打开新的窗口，你必须确定细节以上传到 Steam 的网站，如下图: 在窗口顶部，你可以看到游戏名 (人们在 Steam 里将会看到的)，然后上传你的游戏截图。

source: When you want to draw text in your game this text is drawn in a standard Arial 12 points font, but to make more interesting or unique looking texts you will probably want to use different fonts, however.
zh_cn: 当你想要在游戏中绘制文字时，这些文字是使用标准的 Arial 12 号字体绘制的。但是为了让你的游戏看起来更独特更有趣，你可能想要使用不同的字体。

source: Where the GUI is positioned (ie: the (0,0) position) will depend on whether you have used the function display_set_gui_maximise() or not.
zh_cn: GUI放置的位置 (比如 (0,0)位置)取决于你是否使用这个函数 display_set_gui_maximise() 。

source: Whether the particular view is visible on the screen.
zh_cn: 是否指定的视野会在屏幕上显示。

source: Whether to set the screen to fullscreen (true) or not (false).
zh_cn: 设置屏幕为全屏（true）或不是（false）。

source: Whether views are enabled or not.
zh_cn: 是否启用视野。

source: While GameMaker: Studio itself does not require an internet connection to be used, it will require occasional access to maintain the license activated.
zh_cn: GameMaker: Studio 使用时本身并不要求联接互联网，它只是偶尔访问以保持许可证激活。

source: While GameMaker: Studio is a powerful tool, it cannot do everything for you at the touch of a button so start small with simple examples and you will realize that not only is creating games great fun, but that learning to use GameMaker: Studio to do it is also very rewarding!
zh_cn: 而 GameMaker: Studio 是一个强大的工具，它不能够为您提供一个创造一切的按钮，所以从简单的例子开始，您会意识到，不仅制作游戏很好玩，而且学习GameMaker: Studio 也是值得的！

source: While creating and testing your game, this target module will work exactly the same as the standard Windows module, however when creating your final executable you will be shown additional options to submit the game directly to Steam.
zh_cn: 当创建和测试您的游戏，额外的模块将会以标准的windows模块运行，然后当您创建最终exe可执行程序时将显示 直接提交到steam 的额外选项。

source: Why?
zh_cn: 为什么呢？

source: Width of the view in the room.
zh_cn: 房间视野的宽度。

source: Width of the viewport in the drawing region.
zh_cn: 绘制区域的视口宽度。

source: Windows 8 Professional or Enterprise Edition
zh_cn: Windows 8 专业版或企业版

source: Windows 8 app development (JavaScript and Native packages)
zh_cn: Windows 8 应用程序开发 (JavaScript 和 本地包)

source: Windows 8, running 64-bit.
zh_cn: 64 位 Windows 8 系统。

source: With GameMaker: Studio you can start to prototype and create your own computer games quickly and easily without the absolute need to learn a programming language.
zh_cn: 您可以使用 GameMaker: Studio 迅速并轻松地开始创造您自己的电脑游戏，并且不需要学习任何一门编程语言。

source: With that done how do we use an array for practical things?
zh_cn: 然后，我们怎么实际应用呢？

source: With that done, everything that would appear in view 0 will now be drawn to the surface we have created instead.
zh_cn: 之后，所以将出现在视野view 0中的事物现在绘制到我们创建的表面层里。.

source: With the Debug Module, you can set these at any time and in any code block, and you can also set them from the GameMaker: Studio IDE.
zh_cn: 在调试模块中，你能在任何时间任何代码块中设定断点，你也能在GameMaker: Studio IDE中来设置。

source: With the Mac OSX module you can target the Apple desktop market
zh_cn: Mac OSX 模块可以使您发布到苹果台式机市场

source: With the Tizen module you can target a vast number of "smart" devices
zh_cn: Tizen 模块可以使您发布到大量的 "smart" 设备上

source: With the above code you are setting the speed of an instance of "obj_ball".
zh_cn: 上述代码中你正在设定“obj_ball”的一个实例的移动速度。

source: With the information in the preceding sections of this manual you can begin to create your games, but when your game is finished you obviously want other people to play it.
zh_cn: 手册前面的部分讲解了如何创建一个游戏，但是当游戏完成时你肯定希望其他人可以玩它。

source: With the professional version of GameMaker: Studio all limitations are removed and you can experiment with all the features of the program:
zh_cn: 专业版 GameMaker: Studio 中所有限制被移除，你可以实验程序的特点:

source: With the resources you have seen so far you can add some nice images and sounds to the game resource tree, but they don't do anything in the game itself yet!
zh_cn: 到目前为止你可以添加漂亮的图像和优美的声音资源，但是它们还没有在游戏内做任何事！

source: With this function you can center the game window in the display when the target module is Windows, Ubuntu (Linux) or MacOS, or you can center it in the browser if the target module is HTML5.
zh_cn: 对于Windows, Ubuntu (Linux) 或者 MacOS 平台， 你可以使用这个函数将游戏窗口屏幕居中，而对于HTML5目标模块，是浏览器居中。

source: With this function you can change or set the position of the mouse within the game display which can be useful for FPS games, for example.
zh_cn: 有了这个函数，你便可以更改或设置游戏屏幕上的鼠标位置，对于FPS游戏来说，这可能会比较好用。

source: With this function you can change or set the position of the mouse within the game window which can be useful for FPS games, for example.
zh_cn: 有了这个函数，你可以更改游戏窗口的鼠标位置，这在FPS游戏中非常有用。

source: With this function you can change or set the windows caption for the room that you are currently in.
zh_cn: 有了这个函数，你可以更改或设置当前所在房间的窗口标题。

source: With this function you can change the size of the game window.
zh_cn: 有了这个函数，你可能更改游戏窗口的大小。

source: With this function you can copy the contents of one grid into another one.
zh_cn: 使用这个函数你能够把一个栅格内的内容复制给另一个。

source: With this function you can enable or disable the application surface.
zh_cn: 可以用这个函数启用或禁用应用表面层。

source: With this function you can find the overlapping region of the rectangle defined by (x1,y1) to (x2,y2) on each of the attached displays.
zh_cn: 使用这个函数你可以查找 (x1,y1) 到 (x2,y2)矩形范围内的每个附加显示器的重叠区域。

source: With this function you can get the current cursor being used in the game window, with the return value being any one of the constants listed below (to set the current cursor being used you can use the function window_set_cursor which also takes these constants):
zh_cn: 可以用这个函数获得当前游戏窗口使用的鼠标指针，返回值将下面所列的常量中的一个（设置当前的鼠标指针可以使用这个函数 window_set_cursor ，同样也是使用下面的常量）：

source: With this function you can get the current height (in pixels) of the game window.
zh_cn: 这个函数可以获取游戏窗口的高度（像素为单位）。

source: With this function you can get the current width (in pixels) of the game window.
zh_cn: 通过这个函数获取游戏窗口当前宽度（像素为单位）。

source: With this function you can get the full abgr 32bit value of any pixel of a (previously created) surface.
zh_cn: 用这个函数获取一个预先创建好的表面的 abgr 32位真彩色。

source: With this function you can get the height (in pixels) of the GUI as used in the Draw Gui Event.
zh_cn: 用这个函数获取 Draw Gui Event中已使用（绘制内容）的像素高度。

source: With this function you can get the internal Windows id value (a pointer).
zh_cn: 有人这个函数，你可以获取内置的窗口ID的值 (a 指针)。

source: With this function you can get the width (in pixels) of the GUI as used in the Draw Gui Event.
zh_cn: 使用这个函数获取 Draw Gui Event中已使用（绘制内容）的像素高度。

source: With this function you can get the x position (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or MacOS game.
zh_cn: 通过这个函数，你将获取HTML5游戏浏览器内窗口的x坐标，或者者Windows, Ubuntu (Linux) 或者 MacOS 游戏显示屏内的窗口坐标。

source: With this function you can get the x position of the mouse cursor (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or MacOS game.
zh_cn: 有人这个函数，你可获得游戏窗口的鼠标指针的x坐标（像素为单位），如果是HTML5游戏则位于浏览器之内，如果是 Windows、 Ubuntu (Linux)或 MacOS 游戏，则位于显示屏以内。.

source: With this function you can get the y position (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or MacOS game.
zh_cn: 通过这个函数，你将获取HTML5游戏浏览器内窗口的y坐标，或者者Windows, Ubuntu (Linux) 或者 MacOS 游戏显示屏内的窗口y坐标。

source: With this function you can get the y position of the mouse cursor (in pixels) within the browser if it is an HTML5 game or within the display if it is a Windows, Ubuntu (Linux) or MacOS game.
zh_cn: 有人这个函数，你可获得游戏窗口的鼠标指针的y坐标（像素为单位），如果是HTML5游戏则位于浏览器之内，如果是 Windows、 Ubuntu (Linux)或 MacOS 游戏，则位于显示屏以内。.

source: With this function you can poll the window (or tab) state and if it loses focus the function will return false otherwise it will return true.
zh_cn: 有了这个函数，你可以查询窗口（标签）的状态，如果失去焦点，函数将返回 false ，否则返回 true。

source: With this function you can save a screenshot of a part of the game as it currently appears in the game window or browser.
zh_cn: 使用这个函数可以对当前游戏窗口浏览器显示的内容的一部分进行截图保存。

source: With this function you can save a screenshot of the game as it currently appears in the game window or browser.
zh_cn: 使用这个函数可以对当前游戏窗口浏览器显示的内容截图保存。

source: With this function you can set the cursor for the game window to any one of the constants listed below (to find the current cursor being used you can use the function window_get_cursor which will also return one of these constants):
zh_cn: 有了这个函数，你可以设置游戏窗口的光标为下面列出的任意一个常量（获取当前使用的光标可以使用函数window_get_cursor ，它将返回这些常量中的一个）：

source: With this function you can set the game window to a specific position within the display (on MacOS, Linux(Ubuntu) and Windows) or within the browser (HTML5).
zh_cn: 有了这个函数，你可以设置游戏窗口至显示器内的特定位置 （适用 MacOS, Linux（Ubuntu） 和 Windows） 或者浏览器内 （HTML5）。

source: With this function you can set the game window to be full screen (true) or not (false).
zh_cn: 有了这个函数，你可以设置游戏窗口为全屏幕（true）或者不是全屏（false）。

source: With this function you can set the position of the game window within the browser (HTML5) or display (Windows, Ubuntu (Linux) or MacOS) and set the scale of the window too.
zh_cn: 有了这个函数，你可以设置浏览器内（HTML5）或者显示器内（Windows、 Ubuntu （Linux）或者 MacOS）游戏窗口的位置和 大小。

source: With this function you reset all further drawing from the target surface back to the screen.
zh_cn: 用这个函数重置后面所有的绘制，从目标表面层返回到屏幕上。

source: With this function you set all further drawing to the target surface rather than the screen and in this way you can tell GameMaker: Studio to only draw specific things to the specified surface.
zh_cn: 使用这个函数可以设置接下来的绘制为目标表面层而不是屏幕，用这种方法告诉GameMaker: Studio 只绘制特定的内容到特定的表面层。

source: With this variable you can get (or set) the object that has to be kept in the specified view (from 0 to 7) at all times.
zh_cn: 有了这个变量，你可以获取（或设置）在任何时候都保持指定在视野（0-7）的物体。

source: With this variable you can get or set the x position of the view port.
zh_cn: 有了这个变量，可以获取或设置视口的x坐标。

source: With this variable you can get or set the y position of the view port.
zh_cn: 有了这个变量，可以获取或设置视口的y坐标。

source: With this variable you can set a given view to draw to a surface, or get the current surface id if one has been assigned to a view.
zh_cn: 有了这个变量，你可以设置一个给定的视野绘制到一个表面上，或者如果已经指定给了一个视野，获取它当前表面的id。

source: With this variable, you can get (or set) the angle at which the view is to be drawn.
zh_cn: 有了这个变量，你可以获取（或设置）正在绘制的视野的角度。

source: X position of the view in the room.
zh_cn: 房间视野的X坐标。

source: Y position of the view in the room.
zh_cn: 房间视野的Y坐标。

source: You also have a couple of specialist functions that are designed only for use with the application surface:
zh_cn: 你也有只为应用表面专门设计的函数可以使用：

source: You are asked for a new name before saving.
zh_cn: 保存前会被询问新名字。

source: You are free to distribute the games you create with GameMaker: Studio in any way you like, and this means that you can even sell them!
zh_cn: 你可以用任何你喜欢的方式发布你用 GameMaker: Studio 创建的游戏，这意味着可以卖给别人！

source: You are given the option to install the program anywhere you like but it is recommended that you follow the default suggestions given.
zh_cn: 您可以选择任何您喜欢的目录安装本程序，但建议您选择的默认的位置进行安装。

source: You are not actually passing the array itself into the script (as you would a variable), but instead you are requesting that the script create a copy of this array, which you will change in the script.
zh_cn: 你不是传递这个数组自身（数组变量），代替的是要求脚本创建这个数组的拷贝（副本），脚本中可以随意更改。

source: You can add points to the path using the Add button, which will add a new point to the path, but at the same position as the previous path point created (or at the path start position if none have been created yet).
zh_cn: 你可以用 Add 按钮来向路径中添加路径点，这个新的路径点的位置会和你添加的最后一个路径点重合（或者如果当前路径中没有路径点，那么这个新的点就会成为起始路径点）。

source: You can also access a single instance of an object when there are multiple instances within the room using the instance id to tell GameMaker: Studio exactly which instance we wish to address.
zh_cn: 当你知道房间里有一个物体的多个实例时，你也可以访问物体的单个实例，使用 实例的“id”告诉 GameMaker: Studio 具体想要访问哪个实例。

source: You can also add or subtract one from a value using ++, --.
zh_cn: 你甚至可以用以下符号加减一 ： ++，--。

source: You can also assign a single instance id to this variable, in which case that particular instance is followed.
zh_cn: 你也可以指定一个单独的实例id给这个变量，视野会跟随这个特别的实例。

source: You can also call up the properties by double clicking on the resource.
zh_cn: 也可以用双击资源来实现。

source: You can also change some of the values for the variables shown by simply double-clicking on the value and giving it a new one.
zh_cn: 你也仅通过在变量上双击来改变其中某些变量，赋予其新的值。

source: You can also choose whether the conversion should be mono, stereo or 3D.
zh_cn: 你还可以选择是否转换为单声道、立体声或 3D。

source: You can also delete an array simply by "re-assigning" the variable that defines it to a single value.
zh_cn: 删除一个数组仅需要对定义它的变量重新赋予一个值。

source: You can also do checks and run code on parent objects which automatically include the child objects too which saves a lot of time and energy.
zh_cn: 你也可以在检测和执行父对代码的同时自动包含子对去节省大量的时间和精力。

source: You can also find many more sprites on the web, normally in the form of PNG strips or animated GIFs.
zh_cn: 你也可以在网上找更多的精灵，通常是 PNG 或 GIF 格式的动画。

source: You can also have multiple wave files playing at once, which is why you should use these for all the sound effects in your game.
zh_cn: 你也可以同时播放多个 wave 文件。这就是为什么你应该使用 wave 文件作为音效的原因。

source: You can also indicate an offset (in pixels) where the top left-most tile starts as well as a separation between the tiles (in pixels) between the tiles themselves.
zh_cn: 你也可以设置左方和上方的偏移量 (像素为单位) 以及磁贴之间的分离量 (像素为单位)。

source: You can also read this variable to get the index of the surface that has been assigned to the chosen view or it will return -1 if no surface has been assigned, and generally the surface used for this function should be the size of the view itself (not the view port).
zh_cn: 你可以读取这个变量以获取选择的表面的已经指定的表面的索引，如果没有指定表面则返回-1，并且一般用于这个函数的表面应该和视野一样大小（不是视口）。

source: You can also refresh the feed (to check for new files) by clicking the button at the bottom left of the window.
zh_cn: 你也可以通过点击窗口左下按钮刷新 feed (检查新文件)。

source: You can also see the state of any built in or instance variables that they have, and you can right-click on a value to set its type (see Data Types, below)
zh_cn: 你也可以观察任何内置的变量或者它们拥有的实例的变量的状态，然后你可以右击在值上面来设定它的类型（见下文的数据类型）。

source: You can also select to import Legacy GameMaker files with the extensions gm81, gmk, gm6 or gb1...n files from here.
zh_cn: 你也可以导入老版本的 GameMaker 文件例如 gm81、gmk、gm6 或是 gb1...n 文件。

source: You can also set the speed to follow the path and a number of other actions relating to the position and orientation of the path within the room.
zh_cn: 同时你也可以设置沿路径运动时的速度，以及在运动到不同位置及方向时执行不同的动作。

source: You can also set this variable to effectively turn "on" or "off" a view by setting the value to true (visible) or false (invisible).
zh_cn: 可以通过设置这个变量的值的true (可见) or false (不可见)，来“打开”或“关闭”一个视野。

source: You can also specify the precision for the curves (default is 4) which can be from 1 to 8 with 8 being the smoothest.
zh_cn: 同时你可以设置曲线的平滑程度（默认是4），范围是1至8，其中8最为平滑。

source: You can also split the main watch area into multiple windows using the "Split" option from the top window bar, permitting you to organise the layout to suit your needs (and these layouts can also be saved through the "Window" drop down menu).
zh_cn: 你也可以使用窗口顶端的横条中的“Split”功能把主窗口区域划分成多个窗口，这个操作允许你组织布局来满足你的需求（而这些布局也可以通过顶端下拉菜单“Window”来存储）。

source: You can also upload these files to the different hosting services for individual distribution or to online stores (like Google Play, iTunes or the MS Store) for general distribution and retail.
zh_cn: 你也可以上传这些文件到不同主机服务器或在线商店 (如 Google Play、iTunes 或 MS Store) 发布和销售。

source: You can also use a time line to control your game more globally.
zh_cn: 你也可以更加全局化的用时间轴来控制你的游戏。

source: You can also use variables, as long as the variable in question has stored a valid instance id.
zh_cn: 你也可以使用变量，只要这个变储存一个有效的instance id（实例ID）。
